In [3]:
# importing library
import numpy as np
import pandas as pd

## 1. Write Use of melt function.

In [6]:
df = pd.read_csv("data/batch.txt")
df

   regno    name  marks
0      1    Anil   28.0
1      2   Sagar    NaN
2      3   Ganga   45.0
3      4     NaN   56.0
4      5  Sanjay   54.0

In [7]:
pd.melt(df, id_vars =['name'], value_vars =['marks'])

     name variable  value
0    Anil    marks   28.0
1   Sagar    marks    NaN
2   Ganga    marks   45.0
3     NaN    marks   56.0
4  Sanjay    marks   54.0